---
kind: type
id: T:Autodesk.Revit.DB.IOpenFromCloudCallback
source: html/266c8a04-c451-539d-8885-1626b131931d.htm
---
# Autodesk.Revit.DB.IOpenFromCloudCallback

An interface that may be used to control Revit's behavior when opening a cloud model.

## Syntax (C#)
```csharp
public interface IOpenFromCloudCallback
```